from enum import Enum

from constants.constants import INSTAGRAM_LINK

MOTIVATION_PHRASES_FOR_MISTAKES = [
    "<b>🌱 Майже вдалося! Кожна помилка — крок до майстерності.</b>",
    "<b>💡 Не переймайся, з кожною спробою ти навчаєшся!</b>",
    "<b>🚧 Помилки означають, що ти ростеш — продовжуй!</b>",
    "<b>✨ Так тримати! Практика — шлях до ідеалу.</b>",
    "<b>🔄 Ще не зовсім, але ти на правильному шляху!</b>",
    "<b>🌟 Кожна помилка — шанс стати кращим!</b>",
    "<b>🛠️ Продовжуй розвивати навички — все супер!</b>",
    "<b>🎯 Близько! Виправ і спробуй ще раз — у тебе вийде!</b>",
    "<b>📈 Прогрес не завжди ідеальний, але це все одно прогрес!</b>",
    "<b>🔥 Не зупиняйся, твої навички вже «нагріваються»!</b>",
]

SUCCESS_PHRASES = [
    "<b>🎉 Вітаємо! Ти пройшов(-ла) вікторину.</b>",
    "<b>🏆 Молодець! Усе вийшло на відмінно!</b>",
    "<b>🚀 Класна робота! Ти гарно просуваєшся.</b>",
    "<b>🌟 Фантастично! Ти впорався з цим раундом.</b>",
    "<b>👏 Браво! Ти — справжня зірка!</b>",
    "<b>✅ Успіх! Ти завершив(-ла) вікторину як профі.</b>",
    "<b>🥳 Ура! Ще один крок до вільного володіння мовою!</b>",
    "<b>🔥 Цей раунд знищено! Продовжуй у тому ж дусі.</b>",
    "<b>💪 Вражає! Ти дуже швидко прогресуєш.</b>",
    "<b>📚 Чудова робота! Ще одна вікторина позаду.</b>",
]

USER_NOTIFICATIONS = [
    "<b>👋 Привіт! Твоя подорож в англійську чекає на тебе в Clanity. Погнали далі!</b>",
    "<b>📚 Готовий(-а) вивчити нові слова сьогодні? Я на місці!</b>",
    "<b>⏳ Давно не бачилися! Твій прогрес чекає — давай повертаймося!</b>",
    "<b>🎯 Нове завдання з англійської вже готове. Піднімемо рівень разом!</b>",
    "<b>🧠 Лише кілька хвилин на день — і слова не забудуться 😌\n\nПовернись до Clanity!</b>",
    "<b>✨ Ти вже досяг(-ла) класного прогресу. Не зупиняйся!</b>",
    "<b>💬 Хочеш швиденько потренуватися? У мене є вікторина саме для тебе!</b>",
    "<b>📈 Пам’ятаєш свою мету? Ти ближче, ніж думаєш. Продовжуй!</b>",
    "<b>🙌 Я все ще тут, готовий допомогти вивчати англійську. \n\nПриєднуйся будь-коли!</b>",
    "<b>🚀 Щодня ти вивчаєш трохи більше. \nТримай темп!</b>",
]

SIMPLE_SUB_DESCRIPTION = (
    "<b>Рівень підписки SIMPLE</b>🤩\n\n"
    "Цей рівень дозволяє <u><b>додавати власні файли (.xlsx)</b></u> зі словами та <u><b>вивчати їх у режимі вікторини</b></u> 🤩.\n"
    "<i>*з необмеженою кількістю раундів</i>\n\n"
    "Ми також можемо <u><b>зберегти ваш улюблений файл</b></u>, щоб зробити навчання простішим, зручнішим і комфортнішим.\n\n"
    "<b>Clanity — це легкий спосіб вивчати нові слова:</b>\n"
    "<i>- будь-яка мова, яка вам потрібна</i>\n"
    "<i>- будь-де</i>\n"
    "<i>- будь-коли</i>"
)

START_SUB_DESCRIPTION = (
    "<b>Рівень підписки START</b>🚀\n\n"
    "Цей рівень включає все з <u><b>підписки Simple</b></u>:\n"
    "— можливість <u><b>додавати власні файли (.xlsx)</b></u> зі словами\n"
    "— <u><b>вивчати їх у режимі вікторини</b></u> з <i>необмеженою кількістю раундів</i> 🤩\n"
    "— <u><b>зберігати улюблений файл</b></u> для простішого й комфортнішого навчання\n\n"
    "<b>ДОДАТКОВО ➕</b> ви отримуєте доступ до <u><b>бібліотеки з 1000+ попередньо завантажених слів рівнів A1–A2</b></u>, ретельно відібраних для початківців 🌱\n"
    "<u><b>тематичні ігри зі словами</b></u> 😍\n"
    "Починайте навчання одразу — не потрібно готувати власні списки слів!\n\n"
    "<b>Clanity — це легкий спосіб вивчати нові слова:</b>\n"
    "<i>- будь-яка мова, яка вам потрібна</i>\n"
    "<i>- будь-де</i>\n"
    "<i>- будь-коли</i>"
)

PRO_SUB_DESCRIPTION = (
    "<b>Рівень підписки PRO</b>👑\n\n"
    "Ви отримуєте все з підписок <u><b>Simple</b></u> та <u><b>Start</b></u>:\n"
    "— <u><b>додавайте власні файли (.xlsx)</b></u> і вивчайте слова в <b>режимі вікторини</b> 🤩\n"
    "— <u><b>зберігайте улюблений файл</b></u> для комфорту\n"
    "— доступ до <u><b>1000+ готових до вивчення слів (рівні A1–A2)</b></u> 🌱\n\n"
    "— <u><b>ігри з тематичними словами</b></u> 🌱\n\n"
    "<b>ДОДАТКОВО ➕</b> Ви відкриваєте повну потужність словникового запасу —\n"
    "<u><b>2000+ слів</b></u>, що охоплюють усі рівні CEFR: <b>B1 → C2</b> 💪\n"
    "Опановуйте слова для подорожей, роботи, навчання та вільного спілкування.\n"
    "<i>Незалежно від вашого рівня — ви повністю підготовлені.</i>\n\n"
    "<b>Clanity — це легкий спосіб вивчати нові слова:</b>\n"
    "<i>- будь-яка мова, яка вам потрібна</i>\n"
    "<i>- будь-де</i>\n"
    "<i>- будь-коли</i>"
)


class InteractivePhrases(Enum):
    WELCOME_MESSAGE = (
        "Привіііііт))👋\nОбирай будь-який рівень гри) маю надію, що тобі сподобається😌"
    )
    LOW_SUBSCRIPTION_LEVEL = "Вибач(\n\n<b>Твоя підписка не дозволяє це.</b> Щоб використовувати цей тип вікторини, потрібно перейти на вищий рівень 🙌"
    SUBSCRIPTION_LIST_MESSAGE = "Привіт 👋\n\nОсь список наших підписок. Натисни на будь-яку, щоб дізнатися більше."
    SUCCESS_SET_LIMIT = "✅ Починаємо вікторину..."
    ASK_TO_SEND_FILE = "📝 Чудово! Зараз я перевірю тебе на словах. Надішли мені Excel-файл. \n\n<i>*Можеш переслати вже надісланий файл з нашого чату)</i>"
    START_QUIZ = "✅ Єєєє, погнали!\nЩоб зупинити гру — напиши команду \n\n/stop_quiz\n\n <i>або натисни кнопку 'Зупинити вікторину' у меню</i>"
    FINISH_QUIZ = "✅ Вікторина завершена! 🎉"
    START_FIRST_QUIZ_WORD = "✅ Переклади це слово:\n\n👉 <b>{current_word}</b>"
    CORRECT_USER_WORD = "✅ Правильно!\n\nНаступне слово 👉 <b>{next_original_word}</b>"
    INCORRECT_USER_WORD = "❌ Неправильно. Правильна відповідь: <b>{correct_answer}</b>\n\nНаступне слово 👉 <b>{next_word}</b>"
    PASSED_USER_WORD = "Правильна відповідь була: <b>{correct_answer}</b>\n\nНаступне слово 👉 <b>{next_word}</b>"
    EMPTY_FILE = "❌ Файл не знайдено. Будь ласка, перезапусти вікторину."
    SUCCESS_GET_PREVIOUS_FILE = "✅ Попередній файл завантажено з сервера"
    SUCCESS_PURCHASE_PAYMENT = "✅ Успішна покупка"
    STOP_QUIZ = "🛑 Вікторина зупинена"
    ADD_PROMOCODE = "**Вау😍 Чекаю на твій промокод))**"
    INSTRUCTION = (
        "🙋\n\n"
        "Clanity – це платформа, котра допоможе тобі вивчати нові слова англійською \n"
        "<i> - будь-де</i>\n"
        "<i> - будь-коли</i>\n\n"
        "ти можеш використовувати різні типу ігор, відповідно до своєї рівню своєї підписки, "
        "але якщо ти тільки хочеш спробувати, побачити що цей сервіс може - "
        "<u><b>ми даруємо тобі три дні PRO підписки</b></u>😍"
    )

    FILE_SEND_INSTRUCTION = (
        "📖 *Як користуватись цим режимом?*\n\n"
        "1️⃣ Надішли мені `.xlsx` файл зі словами та перекладами\n"
        "2️⃣ Я буду показувати слова — ти пиши переклад\n\n"
        "_Просто скинь файл і я вже готовий)_\n"
        "📂 Ось приклад файлу, щоб почати 👇"
    )
    HELP = (
        "Дякую за повідомлення 🤍\n\n"
        "Якщо ти знайшов(-ла) помилку або проблему, напиши нам у соцмережах:\n\n"
        f'Instagram: <a href="{INSTAGRAM_LINK}">@clanity.lang</a>\n'
        "Gmail: clanityhelp@gmail.com"
    )
