CREATE_SENTENCE_PROMPT = lambda current_word, translation: (
    f"Придумай речення зі словом '{current_word}', в якому контексті я міг би його використовувати."
    f" Ось тобі переклад для контексту '{translation}'. Це речення має бути англійською. "
    f"Речення має бути 5-7 слів максимум!"
)

DESCRIBE_WORD_PROMPT = lambda current_word, translation: (
    f"Опиши англійське слово '{current_word}' простими словами, щоб допомогти його перекласти українською. "
    f"Не використовуй саме слово, але опиши його. Ось тобі переклад для контексту '{translation}',"
    f"але не використовуй його в описі слова простими словами. Максимум 2 речення, а загалом слів 5-7,"
    f"простою мовою, в стилі, що ти хочеш пояснити підлітку це слово, щоб він просто його зрозумів, як би нагадати йому сенс цього слова"
)
